sulaolab/dspic33ak-audio-dsp-sonora/src/app/app_specific_config_defs.h
#ifndef APP_SPECIFIC_CONFIG_DEFS_H
#define	APP_SPECIFIC_CONFIG_DEFS_H


//===========================================================
// EARLY CLOCK CONSTANTS
//===========================================================
// FCY must be visible BEFORE <xc.h>: <xc.h> transitively pulls in <libpic30.h>, whose
// __delay_ms()/__delay_us() macros are built against FCY.
//
// PLL1_CLK_HZ is the Sonora boot PLL1/CLKGEN output frequency. FCY is derived
// from it and must remain visible before <xc.h>.
//
// Integer (UL) literals -- not 200e+6 -- so FCY and any derived clock math stay integer.
// Do NOT add definitions here that depend on <xc.h> device symbols/registers.
#define PLL1_CLK_HZ                     (200000000UL) // boot PLL1/CLKGEN output
#define FCY                             (PLL1_CLK_HZ / 2UL) // instruction-cycle frequency


//===========================================================
// INCLUDES
//===========================================================
#include <xc.h>
#include <stdio.h>
#include <stdlib.h>
#include <stdint.h>
#include <stdbool.h>
#include <math.h>


/* ============================================================
 * app_specific_config_defs.h
 *
 * Project/application-level configuration -- the SINGLE app-config file.
 *
 * This file intentionally contains three logical layers (formerly the separate
 * app_config_cmsis.h / app_specific_config_resolved.h / app_specific_config_validate.h
 * headers, now merged here):
 *
 *   1. Raw project/app settings    - direct user/project selections: platform
 *                                    constants, build toggles, hand-tuned sound params.
 *   2. Resolved / derived settings - facts COMPUTED from the raw settings (the ENA_*
 *                                    tree -> 0/1 APP_* facts, geometry, feature set).
 *                                    No independent user choices here.
 *   3. Validation                  - reject invalid / inconsistent combinations.
 *                                    Creates no new configuration values.
 *
 * Keep the order: Raw -> Resolved -> Validation. Each layer depends on the one above.
 * Do not split these layers back into separate headers unless the file becomes too
 * large to manage -- the split was removed because the include-order / dependency /
 * partial-state reasoning cost outweighed its benefit at this size. The three logical
 * layers are preserved here as clearly-marked sections instead of separate files.
 * ============================================================ */


/* ============================================================
 * 1. Raw project/app settings
 * ============================================================ */

//-----------------------------------------------------------
// 1a. PLATFORM  (order-sensitive -- do NOT reorder this block)
//-----------------------------------------------------------

// --- Platform clocks and peripheral rates ---
// PLL1_CLK_HZ / FCY live in the EARLY CLOCK CONSTANTS block at the top of this
// file (FCY must precede <xc.h>).

#define UART_BRG                        (230400)
#define UART_PLATFORM_USE_RX_ISR_RING   (1)         // Platform: UART ring-buffer ISR reception

// Default period (ms) of the app telemetry line printed by audio_transport_dbg_print()
// (TDM load / ASRC / CCP). Runtime-changeable via audio_transport_set_dbg_period_ms().
#define APP_DBG_PERIOD_MS               (2000)


//-----------------------------------------------------------
// 1b. USER TOGGLES  (edit here)
//-----------------------------------------------------------
// Style: each knob is one entry -- "--- HEADING ---", a short prose note, then
// a single #define line. An ACTIVE #define is ON; a "// #define" is OFF. The
// #define line is always last in its entry so it never hides inside the prose.
//
// Grouped into bands, broad -> narrow:
//   HARDWARE       - match to the physical board (set once per PCB).
//   BUILD PROFILE  - pick the overall build (DRC test vs regular, 48k/96k).
//   AUDIO STREAM   - how the TDM/I2S stream is shaped (format/input/topology).
//   EXTRA PATHS    - optional alternate I/O paths; normally all off.
//   CLOCK ROLE     - who drives BCLK/FS.
//   CMSIS / SAI    - CMSIS driver-path + SAI wrapper verification switches.


// --- APP + BUILD VARIATION ---
// APP_BUILD is the only top-level selector. It first selects one application, then the
// selected application expands its own variation. Definitions live under src/apps/:
//   apps/classic/classic_demo_build_config.h  - Standard/DRC/USB/96 kHz variations
//   apps/asrc/asrc_app_build_config.h          - direction/clock-owner/measurement variations
// APP_PROFILE remains a derived compatibility name for the resolved settings below.
#include "apps/app_build_config.h"

// =====================================================================================
//  BUILD CONFIGURATION MAP (quick reference)
//  Top axis = APP_PROFILE (which app). Everything a given build cares about is in its
//  sub-table below; a knob that does NOT appear for your profile is N/A (leave it alone).
// =====================================================================================
//
//  Pick a build with APP_BUILD = <preset> (see the BUILD PRESET block above). The columns show
//  the base toggles that preset expands to -- you normally do NOT set them by hand.
//
//  A) APP_PROFILE = DEMO   (leg B co-clocked; no ASRC; == origin/main)
//     All rows: APP_USE_SPI2_INDEPENDENT_MASTER=0, APP_REQ_B_CODEC_MASTER=0 (both N/A here).
//     Audio format is auto-derived (USB or 96k => I2S). Clock tree is the fixed PLL1<-FRC one that
//     every build shares -- see (2.5e).
//
//       APP_BUILD (preset)      Config                USB_AUDIO_IN  96K_RATE  SPI_TDM_CLK_MASTER  DRC_DF2T_CASCADE
//       STD_DEMO_1  (family default) WM8904-A master        0           0             0                 0
//       STD_DEMO_2              dsPIC master               0           0             1                 0
//       DRC_DEMO                WM8904-A master, DRC       0           0             0                 1
//       USB_48                  USB-audio 48k              1           0             0                 0
//       USB_96                  USB-audio 96k              1           1             0                 0
//       DEMO_96K                non-USB 96k co-clock       0           1             0                 0
//     "master" = who drives BCLK/FS: WM8904-A (external codec master, dsPIC slave), the dsPIC itself,
//     or the Pico2 USB-audio bridge. All use both codecs (WM8904-A/B) at 48K unless 96K is noted.
//     NOTE: USB-audio needs the plain PLL1<-FRC tree, because the codecs are clock slaves to the
//     Pico2 bridge. That is now the only tree there is, so no guard is needed for it any more.
//
//  B) APP_PROFILE = ASRC   (leg B independent domain; ASRC engine on; A heavy DSP dropped)
//     AK512 dual-codec, TDM8. USB_AUDIO_IN / 96K_RATE / SPI_TDM_CLK_MASTER / DRC_DF2T_CASCADE are all
//     N/A here (do not appear). Pick two things:
//       Step 1 - clock owner (APP_ASRC_CLOCK_OWNER):
//         APP_ASRC_CLOCK_OWNER_SPI2   : dsPIC SPI2 generates B's clock (dsPIC-B master)
//         APP_ASRC_CLOCK_OWNER_CODEC  : WM8904-B on its own XTAL (codec-B master; *ar CC RR)  <- default
//       Step 2 - ASRC route (direction / variant):
//         Route              selector                                              A out        B out
//         BIDIR (default)    APP_ENA_ASRC_BIDIR=1                                  resampled B  resampled A
//         FROM_A             APP_ENA_ASRC_BIDIR=0, APP_ENA_ASRC_FROM_B=0           silence      resampled A
//         FROM_B             APP_ENA_ASRC_BIDIR=0, APP_ENA_ASRC_FROM_B=1           resampled B  silence
//         MEAS               APP_ASRC_MEAS=1  (+ APP_MEAS_DIR = AB | BA)           (measurement capture)
//         LIGHT (load test)  APP_B_ROUTE = B_ROUTE_ASRC_LIGHT (override)           both = pure asrc_pull
//       (LED shows the ASRC OUTPUT; BIDIR shows max(A out, B out). No Classic/DRC/Gain/PWM.)
//
//     Common ASRC builds (pick with APP_BUILD):
//       APP_BUILD (preset)        CLOCK_OWNER   ROUTE      (BIDIR / FROM_B / MEAS / LIGHT)  PORT
//       ASRC_CODEC_BIDIR (deflt)    CODEC        BIDIR        1       -      0      -       SPI1/2
//       ASRC_CODEC_A_B_ONLY         CODEC        A->B only    0       0      0      -       SPI1/2
//       ASRC_CODEC_B_A_ONLY         CODEC        B->A only    0       1      0      -       SPI1/2
//       ASRC_CODEC_MEAS             CODEC        MEAS         -       -      1      -       SPI1/2
//       ASRC_DSPIC_BIDIR            SPI2         BIDIR        1       -      0      -       SPI1/2
//       ASRC_DSPIC_LIGHT (test)     SPI2         LIGHT        0       -      0      1       SPI1/2
//       ASRC_CODEC_BIDIR_SPI34_TEST CODEC        BIDIR        1       -      0      -       SPI3/4 (explicit test bank)


// --- HARDWARE / PCB REVISION ---
//   Match these to the physical WM8904 codec board in use.
#define WM8904_PCB_REV4      // REV4 support XTALout(RP16) and MIC Bias
//// workaround ////
#define WM8904_SWAP_ADC_LR   // only Rev.4 PCB(White) needs this -- PCB issue
#define WM8904_SWAP_DAC_LR   // only Rev.4 PCB(White) needs this -- PCB issue
//// workaround ////


// --- RED INPUT JACK (MCHP X32 CODEC PCB) ---
// #define ENA_RED_IN_JACK

// --- MIC INPUT ---
// #define ENA_MIC_IN


// --- PROFILE: DRC test mode ---
//   Selects the DRC (DF2T) biquad-cascade build instead of the regular feature set.
//   Drives the buffer-sizing and feature-set blocks in the DERIVED section.
#ifndef ENA_DRC_DF2T_CASCADE
#define ENA_DRC_DF2T_CASCADE     (0)   // 1 = DRC (DF2T) biquad-cascade build  (base default; set by APP_BUILD)
#endif

// --- DIAG: co-clocked SPI1/SPI2 ping-pong phase probe (step-1 experiment, opt-in) ---
//   Measurement ONLY (detect + log, NO auto-correct): the co-clocked single-producer path
//   (SPI1 ISR fills WM8904-B) tears under load if SPI1/SPI2 TX ping-pong phases are not
//   aligned. This samples both legs' live TX half each SPI1 block and counts mismatches;
//   the running stats print on the audio_transport_dbg_print telemetry line. Default off.
#define APP_TDM_PHASE_PROBE       (0)   // 1 = sample+report SPI1/SPI2 phase alignment (diagnostic)

