sulaolab/dspic33ak-audio-dsp-sonora/src/app/app_specific_config_defs.h
// --- DIAG: co-clocked phase-mismatch GUARD (opt-in safety net; default OFF) ---
//   Belt-and-suspenders on top of the phase-locked start_all_domains: if the co-clocked SPI2
//   ping-pong is seen crossing its boundary DURING the SPI1 block callback (= B's cross-fill
//   would tear) for APP_TDM_SYNC_GUARD_TRIP consecutive blocks, the main-loop manage path
//   mutes and re-syncs the WHOLE transport (restart -> start_all_domains re-locks phase), never
//   a single leg. With the aligned start this NEVER trips (measured tail_tear=0), so default OFF
//   = zero behaviour change; enable only for hardening. NOT a substitute for the aligned start.
#define APP_TDM_SYNC_GUARD        (0)   // 1 = auto mute + whole-transport resync on persistent mismatch
#define APP_TDM_SYNC_GUARD_TRIP   (8)   // consecutive mismatched blocks before a resync is requested

// --- STARTUP PHASE LOCK (default ON): make co-clocked start deterministic ---
//   The back-to-back SPIEN start is NOT a hardware-guaranteed simultaneous start -- on a
//   free-running external FS the two SPIEN writes can straddle an FS edge, so a co-clocked domain
//   can occasionally come up ~2 frames offset -> WM8904-B tears (observed: intermittent boot tear,
//   clean after a reset). This verifies, while still MUTED, that every co-clocked domain is
//   phase-locked (position diff within tol) a few blocks after start; if not, it re-arms the domain
//   and retries, letting the caller unmute only once locked. Guarantees a clean boot regardless of
//   the marginal SPIEN race and of code-layout timing shifts.
//   LOCK is declared only when ALL of these hold for APP_TDM_LOCK_CONSEC_OK consecutive blocks:
//   |wdiff|<=TOL_WORDS, no half-mismatch (h1==h2), no tail_tear (SPI2 half unchanged across the
//   callback), and the mirrored B-write target is NOT SPI2's transmitting half. wdiff==0 ALONE is
//   necessary-but-not-sufficient (HW showed wdiff=0 with tail_tear=samp + audible tear), so
//   tail_tear/unsafe-target act as vetoes: mis-declaring re-arms (safe), never unmutes a torn start.
#define APP_TDM_STARTUP_PHASE_LOCK (1)  // 1 = verify + re-arm until co-clocked domains lock, then unmute
#define APP_TDM_LOCK_RETRIES       (5)  // max re-arm attempts before giving up (stay muted + report)
#define APP_TDM_LOCK_CONSEC_OK     (6)  // consecutive all-conditions-OK blocks required to declare LOCK
#define APP_TDM_LOCK_WAIT_MS       (12) // per attempt: wait window for the ISR to reach CONSEC_OK (~18 blocks)
#define APP_TDM_LOCK_TOL_WORDS     (2)  // max allowed TX-DMA position diff (words) within a domain

// --- RETIRED EXPERIMENT: SPIROV/SPITUR latch (IGNROV/IGNTUR) ---
//   The old APP_TDM_ROVTUR_DETECT knob (clear IGNROV/IGNTUR so RX-overflow/TX-underrun latch) is
//   GONE. Letting SPIROV or SPITUR become a critical-stop condition can suspend the leg and turn a
//   primary DMA service failure into a permanent callback stall. HW investigation identified the
//   causal chain as SRAM arbitration delay -> DMAxSTAT.OVERRUN -> stopped RX request service ->
//   downstream SPIROV; DMAPR=1 is the root-cause mitigation. The HAL hard-forces IGNROV/IGNTUR=1
//   only to contain the secondary stop, not to classify data loss as benign. DMA OVERRUN is retained
//   directly as dov=/dirq=/ds= telemetry; SPIROV/SPITUR/FRMERR remain sampled per block as
//   rov=/tur=/frm=. Frame-slip recovery continues to use independent FRMERR.

// --- Bit-slip AUTO-RECOVERY (connector-glitch frame-slip) ---
//   When FRMERR (SPIxSTAT frame-sync error) stays set for RECOVER_BLOCKS consecutive RX blocks on
//   either leg -- a metal-shell connector glitch that slipped the TDM frame and would otherwise stay
//   broken until a HW reset -- auto-restart the transport (== *nt03) so the dsPIC SPI/DMA re-locks,
//   with NO HW reset. Checked from the main loop (audio_transport_frmerr_recover_tick), self-gated at
//   CHECK_MS, with a post-restart COOLDOWN_MS so a single glitch or the re-lock transient never
//   restart-loops. FRMERR latches regardless of IGNROV/IGNTUR (which the HAL forces to 1).
//   Set APP_TDM_FRMERR_AUTORECOVER 0 to compile the recovery out (detection/telemetry stay).
#define APP_TDM_FRMERR_AUTORECOVER   (1)
#define APP_TDM_FRMERR_RECOVER_BLOCKS (32)   // consecutive FRMERR blocks -> recover (~10 ms @ 48k/blk16)
#define APP_TDM_FRMERR_CHECK_MS      (5)     // main-loop self-gate period for FRMERR/liveness checks
#define APP_TDM_FRMERR_COOLDOWN_MS   (500)   // after a restart, skip checks this long (re-lock + anti-loop)
// Deadlock-free recovery = MUTE + restart-until-healthy. A noise-induced frame slip is PERSISTENT
// on this HW (the dsPIC slave latches a wrong frame boundary and stays there even after the noise
// is gone), so a re-lock action IS required. The action that actually re-locks is the full restart
// (audio_transport_restart == *nt03: mute -> stop -> codec re-init -> phase-locked start); a transport-
// only re-arm (no codec re-init) does NOT re-lock. The original auto-recover FIRED that restart but
// then relied on FRMERR-consecutive to re-trigger -- and once the leg is frozen NO blocks complete,
// so FRMERR stops counting and it never RETRIES (the "doesn't recover" bug). Fix: retry the working
// restart until the transport is confirmed HEALTHY (block_count actually advancing), using
// health/liveness -- not the FRMERR counter -- as the retry signal. Stay MUTED across recovery
// (anti-blast). If still not healthy after MAX_RESTART attempts, latch a SAFE-MUTE (silence + fault
// report). A retry succeeds only after NEW clean blocks; a moving-but-misframed stream is rejected.
#define APP_TDM_FRMERR_RELOCK_BLOCKS   (8u)     // NEW blocks after restart that must all be FRMERR-clean
#define APP_TDM_FRMERR_RELOCK_TIMEOUT_MS (300u) // per-attempt wait for the restart to go healthy
#define APP_TDM_FRMERR_MAX_RESTART     (6u)     // restart attempts before the safe-mute latch
#define APP_TDM_LIVENESS_STALL_MS      (20u)    // clock advances but RX block_count does not -> recover


// --- PROFILE: 96 kHz mode ---
//   96 kHz path. Auto-selects I2S format + SAMPLE_RATE in the DERIVED section.
//   NOTE: 96 kHz requires the dual-codec topology (see TOPOLOGY below).
// #define ENA_96K_RATE


// --- INPUT SOURCE ---
//   USB-audio on SPI1/DIM; dsPIC = clock slave.
//   NOTE: for a 96kHz USB host also define ENA_96K_RATE; for 48kHz leave it off.
//   Placed BEFORE AUDIO FORMAT: USB (Pico2) is I2S-fixed, so the format below derives from it.
// #define ENA_USB_AUDIO_IN


