sulaolab/dspic33ak-audio-dsp-sonora/src/app/app_specific_config_defs.h
// --- AUDIO FORMAT ---
//   I2S is a HW FACT (not a user choice) in two cases, so it is auto-derived:
//     - USB-audio (ENA_USB_AUDIO_IN): the Pico2 bridge emits I2S ONLY (2 slots, 1-bit delay) at
//       both 48/96 kHz -- a TDM8 selection would silently mis-frame the Pico2 input.
//     - 96 kHz (ENA_96K_RATE): the WM8904 supports I2S only at 96 kHz (see validation #error).
//   Otherwise (non-USB, 48 kHz) it is the user choice in the #else -- set exactly one to 1:
//     I2S  (2 slots) : also requires APP_USE_1_BIT_DELAY 1 (auto-forced below).
//     TDM8 (8 slots) : default for 48kHz operation.
#if defined(ENA_USB_AUDIO_IN) || defined(ENA_96K_RATE)
  #define APP_USE_I2S_FORMAT      (1)   // USB or 96k: I2S (2 slots) is a HW fact
  #define APP_USE_TDM8_FORMAT     (0)
#else
  #define APP_USE_I2S_FORMAT      (0)   // 1 = I2S  (2 slots)   <-- user choice
  #define APP_USE_TDM8_FORMAT     (1)   // 1 = TDM8 (8 slots)   <-- user choice
#endif

// --- BIT DELAY ---
//   1-bit delay between LRCLK assertion and first data bit.
//   Required (must be 1) when APP_USE_I2S_FORMAT=1; optional for TDM. USB and 96k force I2S -> 1.
#if defined(ENA_USB_AUDIO_IN) || defined(ENA_96K_RATE)
  #define APP_USE_1_BIT_DELAY     (1)   // USB/96k => I2S requires 1-bit delay
#else
  #define APP_USE_1_BIT_DELAY     (0)   // 1 = 1-bit delay enabled   <-- user choice
#endif

// --- FRAME-SYNC WAVEFORM SHAPE ---
//   Selects cfg->fs_shape (HAL feature). The HAL hides FRMSYPW/FRMCNT/CLC:
//     1 = FS_50PCT : 50%-duty FS. I2S -> native (FRMSYPW=1); TDM MASTER -> the HAL emits a
//         half-frame marker and toggles CLC10 into a ~50%-duty FS on the FS pin (owns CLC10
//         + virtual pin RPV8). TDM SLAVE ignores it (FS is an input).
//     0 = FS_PULSE : short 1-BCLK frame sync.
//   NOTE: FS_50PCT-via-CLC10 needs the dsPIC to be the clock master (APP_USE_SPI_TDM_CLK_MASTER 1).
#define APP_USE_FS_50PCT          (1)   // 1 = 50%-duty FS ; 0 = short pulse


// --- TOPOLOGY: dual-codec on MikroBUS-B / SPI2 ---
//   AK512, plus the explicitly selected AK128 Curiosity J3 U-jumper ASRC build
//   (feeds APP_USE_SPI2_AUDIO; resolved_transport_config.h translates it).
//   NOTE: remove bridge resistors between MikroA/B for independent I2C buses.
//   NOTE: 96kHz requires both codecs (WM8904-A=ADC, WM8904-B=DAC; HW limit). See validation below.
#ifndef APP_REQ_MIKROB_WM8904
#define APP_REQ_MIKROB_WM8904     (1)   // 1 = second WM8904 on MikroBUS-B / SPI2
#endif
// Physical SPI bank used by the existing logical codec-A/B TDM pair.
// SPI34_TEST reroutes the SAME MikroBUS A/B WM8904 pins from SPI1/2 to SPI3/4,
// allowing the two available codecs to validate the new peripherals and DMA4-7.
// ALL4 is reserved for the eventual simultaneous two-pair build; it needs a
// second external TDM8 source/sink and a separate board pin map.
#define APP_TDM_PORT_MODE_SPI12       (0)
#define APP_TDM_PORT_MODE_SPI34_TEST  (1)
#define APP_TDM_PORT_MODE_ALL4        (2)
#ifndef APP_ASRC_TDM_PORT_MODE
  #if (APP_BUILD == APP_BUILD_ASRC_CODEC_BIDIR_SPI34_TEST)
    #define APP_ASRC_TDM_PORT_MODE      APP_TDM_PORT_MODE_SPI34_TEST
  #else
    #define APP_ASRC_TDM_PORT_MODE      APP_TDM_PORT_MODE_SPI12
  #endif
#endif
// Keep classic/DRC/USB smoke tests one-knob: changing only APP_BUILD to a
// non-ASRC preset always restores the established physical SPI1/SPI2 bank.
#if APP_PROFILE == APP_PROFILE_ASRC
#define APP_TDM_PORT_MODE             APP_ASRC_TDM_PORT_MODE
#else
#define APP_TDM_PORT_MODE             APP_TDM_PORT_MODE_SPI12
#endif


// --- PWM DAC OUTPUT ---
#ifndef APP_USE_PWM_AUDIO
#define APP_USE_PWM_AUDIO         (0)   // 1 = PWM DAC output path
#endif

// --- BOOT BANNER VISIBILITY (POR/BOR only) ---
// The USB-CDC cable carries both power and console, so on a power-on-class reset
// the terminal has not finished enumerating when the early boot banner (printMenu)
// prints -- debuggers miss it. Holding the boot button at power-on re-prints the
// banner for a short window so it can be caught; not holding it boots immediately
// (single early banner, behavior unchanged = fast boot). Warm resets keep the
// terminal open and are never delayed. The button is sampled once at boot, before
// the app's runtime button controls are active, so there is no functional conflict
// with the runtime button assignments.
#ifndef APP_BOOT_BANNER_HOLD_ENABLE
#define APP_BOOT_BANNER_HOLD_ENABLE    (1)     // 0 = compile the boot-banner hold out entirely
#endif
#ifndef APP_BOOT_BANNER_HOLD_BUTTON
#define APP_BOOT_BANNER_HOLD_BUTTON    (1)     // board button id (1..3) held at power-on to enter banner hold
#endif
#ifndef APP_BOOT_BANNER_HOLD_SECONDS
#define APP_BOOT_BANNER_HOLD_SECONDS   (5)     // banner re-print window length (seconds)
#endif
#ifndef APP_BOOT_BANNER_HOLD_REPEAT_MS
#define APP_BOOT_BANNER_HOLD_REPEAT_MS (1000)  // re-print interval within the window (ms)
#endif

// --- ANC TEST ---
// #define ENA_ANC_TEST


// --- CLOCK ROLE ---
//   default = codec master (dsPIC slave). Set 1 to make dsPIC the BCLK/FS master.
//   REQUIRES: BCLK->MCLK jumper on A-board (TDM8/32-bit: BCLK=MCLK=256fs). HW-VERIFIED 2026-06-21.
//   NOTE: SPIxBRG auto-derived from the Sonora CLKGEN9 transport clock fact.
//#define APP_USE_SPI_TDM_CLK_MASTER (1) // 1 = dsPIC generates BCLK/FS (clock master)
#ifndef APP_USE_SPI_TDM_CLK_MASTER
#define APP_USE_SPI_TDM_CLK_MASTER (0) // 0 = dsPIC is clock slave  (base default; set by APP_BUILD)
#endif


// ASRC-app-private raw configuration (routes, kernel/quality knobs, measurement tones, ...).
// Pulled only for ASRC builds; the shared layer above reads none of it, and the SPI2 bridge input
// it used to provide (APP_REQ_SPI2_INDEPENDENT_MASTER) now comes from the neutral build-configs.
// Classic builds neither include nor need it -- this mirrors the app_build_config.h split.
#if SONORA_APP_IS_ASRC
#include "apps/asrc/asrc_app_config.h"
#endif


// ENA_DMA_SELFTEST: run the NORA hal_dma conformance gate once at boot, right after
//   nora_dma_global_init(). This is the dsPIC33CK application src/app/dma_selftest.c
//   moved here with no code change at all (src/dma_selftest.c), and
//   what it verifies is the CONTRACT, not the DMA: section 4 of
//   [internal] nora_dma_tdm_contract_draft_2026-08-10.md defines conformance
//   as "an application moving, not a header matching". Prints one line
//   ("DMA selftest (ch3, RAM->RAM, software CHREQ): PASS") and borrows channel 3
//   before any transport owns it. Off by default and costed at zero: with
//   isolate-each-function + remove-unused-sections the linker discards the whole
//   module when this is undefined (contract rule R0.1). Default: undefined.
// #define ENA_DMA_SELFTEST

// --- CMSIS DRIVER PATH / SAI VERIFICATION  (was app_config_cmsis.h) ---
// Normally all of these are OFF (HAL-direct paths are the default). Enable only
// when testing the CMSIS layer.

// ENA_CMSIS_I2C: route WM8904 I2C through the CMSIS-Driver wrapper
//   (src/cmsis_driver/Driver_I2C_dsPIC33AK.*). When not defined, the I2C HAL
//   (nora_i2c_*) is called directly. Default: undefined (HAL direct).
// #define ENA_CMSIS_I2C

