sulaolab/dspic33ak-audio-dsp-sonora/src/app/app_specific_config_defs.h
// ENA_CMSIS_USART: initialize and power UART1 through the CMSIS-Driver USART
//   wrapper instead of legacy UART1_Initialize(). Existing stdio / console I/O
//   continues to use the shared UART HAL underneath. Default: undefined.
// #define ENA_CMSIS_USART

// ENA_SAI_WRAPPER_DRYTEST: boot self-test (dry, no live stream). Runs Driver_SAI0
//   API checks once at boot, prints a [SAI-DRYTEST] summary, restores the default
//   config. (Verified 2026-06-21: pass=18 fail=0.)
// #define ENA_SAI_WRAPPER_DRYTEST

// ENA_SAI_WRAPPER_LIVE: LIVE loopback (opt-in). Replaces the demo DSP path with a
//   wrapper-driven passthrough (Receive -> Send, replicated to both codecs). TX is
//   DOUBLE-BUFFERED. Verified glitch-free on HW 2026-06-21. Mutually exclusive with
//   the demo path.
// #define ENA_SAI_WRAPPER_LIVE

// ENA_SAI_WRAPPER_LIVE_TONE: sub-mode of LIVE -- Send a phase-continuous loud tone
//   (~-6 dBFS, 800 Hz, slots 0/1) and ignore RX. Needs LIVE.
// #define ENA_SAI_WRAPPER_LIVE_TONE

// ENA_SAI_LIVE_KEEPALIVE: add an inaudible ~24 kHz keep-alive to the wrapper loopback
//   output (slots 0/1). Needs LIVE; ignored in TONE mode. Opt-in.
// #define ENA_SAI_LIVE_KEEPALIVE

// SAI verification isolation matrix -- set at most ONE. All bypass the demo DSP and
// pass input slots 0/1 to output 0/1; the difference is which side uses the CMSIS
// wrapper copy layer vs a direct demo-path copy:
//   ENA_APP_RAW_BYPASS              : input demo + output demo  (no wrapper) -> OK
//   ENA_SAI_HYBRID_IN_ORIG_OUT_WRAP : output via wrapper Send (tone)         -> OK
//   (ENA_SAI_WRAPPER_LIVE)          : full loopback in+out wrapper            -> OK
// #define ENA_APP_RAW_BYPASS
// #define ENA_SAI_HYBRID_IN_ORIG_OUT_WRAP


//-----------------------------------------------------------
// 1c. SOUND PARAMS  (hand-tuned numeric constants)
//-----------------------------------------------------------
// STAGE_*_PROC_CH must be defined before the Resolved section consumes them below.

#define STAGE_1_PROC_CH           (2)      // stereo
#define STAGE_2_PROC_CH           (4)      // 4ch stereo


// pri gain for WM8904
/////////////////////////////////////////////
#define PRE_GAIN_CODEC_DB         (  0.0f)

// post gain for WM8904
//#define POST_GAIN_CODEC_DB        (  0.0f)
//#define POST_GAIN_CODEC_DB        ( 16.0f)  // for UCA222(Analog-IN to USB Audio)
//#define POST_GAIN_CODEC_DB        (  6.0f)  // -6.0dB in WM8904 output side to reduce hissing noise
#define POST_GAIN_CODEC_DB        ( 12.0f)  // adjusted in=out at FlatEQ


// post gain for PWM
/////////////////////////////////////////////
//#define POST_GAIN_PWM_DB          ( 6.0f) // need some boost
//#define POST_GAIN_PWM_DB          ( 10.0f) // need some boost
#define POST_GAIN_PWM_DB          (14.0f) // at PAS music room test


// gain for the sound effect wave data
/////////////////////////////////////////////
// #define PRE_GAIN_WAV_DB           (-38.0f)
#define PRE_GAIN_WAV_DB           (-26.0f)

// gain for the engine synth
/////////////////////////////////////////////
//#define PRE_GAIN_ENG_SYNTH_DB     (-28.0f)
#define PRE_GAIN_ENG_SYNTH_DB     (-36.0f)

// Gain for the currently selected AVAS synth source (LAMB or TYPE_TY).
// This is the final source gain; per-partial gains remain part of the timbre.
#define PRE_GAIN_AVAS_SYNTH_DB    (-26.0f)


/* ============================================================
 * 2. Resolved / derived settings  (computed from section 1; do NOT hand-edit)
 * ============================================================ */
// Ordering here is load-bearing -- each block depends on macros defined above it.
// This section creates NO independent user choices; it only normalizes / derives.


// (2.0) Target device -- single app-side identity, derived from the toolchain's -mcpu
// predefined macro (the authoritative source). Placed FIRST in the Resolved section so
// every block below selects on APP_TARGET; the __dsPIC33AK*__ vendor macro is confined
// to this one derivation. Add a device: define a token + add one #elif arm.
//
// Token values are OPAQUE and arbitrary on purpose. Compare with == only -- never order
// (< >), never do arithmetic, never infer flash/RAM size or part number from them.
// 0 is reserved as "unset" so an undefined APP_TARGET fails closed (0 != tag).
#define APP_TARGET_AK512   (1)   // arbitrary distinct tag (NOT a size/part number)
#define APP_TARGET_AK128   (2)
// #define APP_TARGET_AK256   (3)   // future

#if   defined(__dsPIC33AK512MPS512__)
  #define APP_TARGET   APP_TARGET_AK512
#elif defined(__dsPIC33AK128MC106__)
  #define APP_TARGET   APP_TARGET_AK128
#else
  #error "Unsupported device -- check -mcpu / MPLAB X device selection."
#endif


// (2.1) Touch: used by the Classic UI on the AK512 Curiosity board.
// The ASRC app has no touch controls, so do not acquire sensors or enable the
// periodic ITC interrupt there.
//
// ENA_OPEN_TOUCH_EXCLUSIVE selects the open ITC touch library (src/hal_touch)
// and is now the default and the only path: the vendor QTouch library has been
// removed from the tree, so the old ENA_TOUCH build no longer exists. The name
// keeps the word 'exclusive' because the property it names still matters --
// exactly one owner may program the ITC. When both libraries were linked, every
// measurement was taken against a peripheral two owners were writing to, which
// cost 3,000 counts of baseline offset before anyone noticed
// ([internal] itc_hardware_reference.md 10).
//
// Defined here rather than left to -D so the demo image and a measurement image
// are the same image. Override it on the build only to take touch out entirely.
#if (APP_TARGET == APP_TARGET_AK512) && SONORA_APP_IS_CLASSIC
  #if !defined(ENA_OPEN_TOUCH_EXCLUSIVE)
    #define ENA_OPEN_TOUCH_EXCLUSIVE 1
  #endif
#endif //(APP_TARGET == APP_TARGET_AK512) && SONORA_APP_IS_CLASSIC


// (2.1b) USB-audio -> I2S coupling: derived up-front at the AUDIO FORMAT section (the
//   ENA_USB_AUDIO_IN toggle was moved above AUDIO FORMAT so APP_USE_I2S_FORMAT /
//   APP_USE_TDM8_FORMAT / APP_USE_1_BIT_DELAY are defined ONCE, positively, per the USB fact --
//   no define-then-#undef override needed here anymore).


// (2.2) Format consistency guard (must follow the user APP_USE_* definitions above).
#if (APP_USE_I2S_FORMAT + APP_USE_TDM8_FORMAT) != 1
  #error "Exactly one of APP_USE_I2S_FORMAT / APP_USE_TDM8_FORMAT must be 1."
#endif

// (2.3) Sample rate, derived from ENA_96K_RATE.
//       Must precede the APP_SLOTS_PER_FS / APP_BLOCK_FRAMES blocks below.
#if defined(ENA_96K_RATE)
  #define SAMPLE_RATE               (96000)
  #if !APP_USE_I2S_FORMAT
    #error "ENA_96K_RATE requires APP_USE_I2S_FORMAT 1 (WM8904 supports I2S only at 96kHz)."
  #endif

#else
  #define SAMPLE_RATE               (48000)

#endif //defined(ENA_96K_RATE)


// (2.3) Block size (APP_BLOCK_FRAMES) is defined LATER, in (2.5f) -- it now depends on
//       APP_B_INDEP_DOMAIN (ASRC engine gate), which is not resolved until (2.5e). See (2.5f).


// (2.4) Slots per frame, derived from the resolved format.
#if APP_USE_I2S_FORMAT
 #define APP_SLOTS_PER_FS         (2)      // I2S:  2 slots
#else
 #define APP_SLOTS_PER_FS         (8)      // TDM8: 8 slots
#endif //APP_USE_I2S_FORMAT


