sulaolab/dspic33ak-audio-dsp-sonora/src/app/app_specific_config_defs.h
// (2.5) The AK128 DIM leaves the MikroBUS-B TDM pins unconnected.  The one
// deliberate exception is the dedicated ASRC build, which joins Curiosity J3
// DIM-P33/P35/P37/P39 to the four AK128 RP pins with U-jumpers.  Never infer
// this capability merely from the target: the ordinary AK128 Classic image
// remains a single-codec image.
#if (APP_TARGET == APP_TARGET_AK128) && \
    (APP_BUILD == APP_BUILD_ASRC_AK128_CODEC_BIDIR)
  #define APP_AK128_J3_TDM_B       (1)
#else
  #define APP_AK128_J3_TDM_B       (0)
#endif

// APP_USE_SPI2_AUDIO is the APP's view of "this build drives a second codec on
// SPI2 (MikroBUS-B)".  This is normally AK512; only the capability above admits
// the AK128 J3 wiring.  resolved_transport_config.h translates it once; project
// HAL config and board consumers read only the neutral result.
#if APP_REQ_MIKROB_WM8904 && \
    ((APP_TARGET == APP_TARGET_AK512) || APP_AK128_J3_TDM_B)
  #define APP_USE_SPI2_AUDIO        (1)
#else
  #define APP_USE_SPI2_AUDIO        (0)
#endif

// Physical transport derivations. SPI34_TEST keeps two dense logical codec legs (A/B)
// but maps their descriptors onto physical SPI3/SPI4. HAL spiN() accessors still mean
// literal physical SPIn; application code uses dense inst(0)/inst(1) via board helpers.
#define APP_TDM_BASE_ON_SPI34 \
    ( (APP_TARGET == APP_TARGET_AK512) && \
      (APP_TDM_PORT_MODE == APP_TDM_PORT_MODE_SPI34_TEST) )
#define APP_TDM_USES_SPI34 \
    ( (APP_TARGET == APP_TARGET_AK512) && \
      (APP_TDM_PORT_MODE != APP_TDM_PORT_MODE_SPI12) )
#if APP_TDM_BASE_ON_SPI34
#define APP_TDM_PHYS_A_NUM          (3u)
#define APP_TDM_PHYS_B_NUM          (4u)
#else
#define APP_TDM_PHYS_A_NUM          (1u)
#define APP_TDM_PHYS_B_NUM          (2u)
#endif

// SST26 owns the AK512's SPI4 peripheral and its dedicated PPS/GPIO pin set. It is
// available only while the audio transport stays on SPI1/SPI2. In SPI3/SPI4 modes
// this single resolved gate removes the driver API/implementation, pin setup, tests,
// and the dependent button sound-effect feature from the build.
#if (APP_TARGET == APP_TARGET_AK512) && !APP_TDM_USES_SPI34
  #define APP_USE_SST26              (1)
#else
  #define APP_USE_SST26              (0)
#endif

// Extra third/fourth HAL legs are present only in the future simultaneous mode.
// SPI34_TEST reuses the two existing dense rows, so it must not enable extra legs.
#if APP_TARGET == APP_TARGET_AK512 && (APP_TDM_PORT_MODE == APP_TDM_PORT_MODE_ALL4)
  #define APP_USE_SPI34_AUDIO       (1)
#else
  #define APP_USE_SPI34_AUDIO       (0)
#endif


// (2.5b) APP_USE_SPI2_INDEPENDENT_MASTER -- effective SPI2 independent-clock-domain fact
// (Phase 1). The raw request APP_REQ_SPI2_INDEPENDENT_MASTER only takes effect where the
// SPI2 audio path actually exists; on a board without it (AK128) it resolves to 0 so the
// whole feature (board master pins, SPI2 callback, config override) compiles out cleanly.
#if APP_REQ_SPI2_INDEPENDENT_MASTER && APP_USE_SPI2_AUDIO
  #define APP_USE_SPI2_INDEPENDENT_MASTER (1)
#else
  #define APP_USE_SPI2_INDEPENDENT_MASTER (0)
#endif

// (2.5d) Q27B -- COHERENT FIXED-OFFSET TEST (measurement-only clock re-source, default 0).
// SPI2 stays an INDEPENDENT MASTER (ASRC engine / transport / servo / callbacks UNCHANGED), but its
// transport clock CLKGEN9 is re-sourced from the FRC-derived PLL1 to PLL2 LOCKED to WM8904-A's
// 12.288 MHz clock output on REFI1<-RP16 (RP16 hard-coded, as the code does -- an earlier version of
// this note said RP75). SPI2's generated BCLK then becomes COHERENT (low wander) with A while
// the fixed A:B offset comes from the UNCHANGED SPI2 BRG (~1.108). This isolates whether a fixed
// rate offset ALONE (no async wander) re-excites the 8-13 Hz limit cycle. The CPU/system stays on
// PLL1 (CLKGEN1) -- DSP SYS clock UNCHANGED. Only the dsPIC PLL2 + BRG knobs are used (no WM8904 FLL,
// no jitter injection). Init order matters: A (codec master) must be up first so its clock output
// feeds REFI1, then CLKGEN9<-PLL2, then SPI2 starts (handled in audio_transport_start_route). PWM must be OFF
// (PLL2 is reused here). Default 0.
#define APP_Q27B_COHERENT_OFFSET (0)
#if APP_Q27B_COHERENT_OFFSET && !APP_USE_SPI2_INDEPENDENT_MASTER
  #error "APP_Q27B_COHERENT_OFFSET needs the independent-master ASRC engine (requires APP_USE_SPI2_INDEPENDENT_MASTER=1)."
#endif
#if APP_Q27B_COHERENT_OFFSET && defined(ENA_PWM_AUDIO)
  #error "APP_Q27B_COHERENT_OFFSET reuses PLL2; disable ENA_PWM_AUDIO (PWM off)."
#endif

// (2.5c) APP_B_CODEC_MASTER -- WM8904-B chip is the TDM master, clocked from B's own on-board
// 12.288 MHz XTAL (board jumper B-XTAL -> B-MCLK). dsPIC SPI2 SLAVES to B's BCLK/FS on an
// INDEPENDENT sync domain. This is the OPPOSITE clock owner from APP_USE_SPI2_INDEPENDENT_MASTER
// (there the dsPIC SPI2 generates the clock); the two are mutually exclusive.
// It rides APP_USE_SPI2_AUDIO; ordinary AK128 builds still resolve it to 0, while
// the dedicated AK128 J3 ASRC build uses codec-master SPI2 slave pins.
// DERIVED (not a user knob): the WM8904-B codec-master request is on ONLY for the ASRC app with
// clock owner = CODEC. Under DEMO it is structurally 0, so a DEMO build can never enter the
// independent B domain (== origin/main classic demo). Opt in via APP_PROFILE=APP_PROFILE_ASRC +
// APP_ASRC_CLOCK_OWNER=APP_ASRC_CLOCK_OWNER_CODEC. Runtime rate command: *ar CC RR; see
// docs_public/wm8904_codec_master_and_rates.md.
#define APP_REQ_B_CODEC_MASTER  ( (APP_PROFILE == APP_PROFILE_ASRC) && \
                                  (APP_ASRC_CLOCK_OWNER == APP_ASRC_CLOCK_OWNER_CODEC) )
#if APP_REQ_B_CODEC_MASTER && APP_USE_SPI2_AUDIO
  #define APP_B_CODEC_MASTER            (1)
#else
  #define APP_B_CODEC_MASTER            (0)
#endif

// (2.5e) APP_B_INDEP_DOMAIN -- axis-1 umbrella: leg B is an INDEPENDENT (async) ASRC domain,
// regardless of WHO drives its clock (dsPIC SPI2 master = APP_USE_SPI2_INDEPENDENT_MASTER, or
// WM8904-B chip master = APP_B_CODEC_MASTER). This gates the ASRC engine / cross-domain data path /
// B-callback route dispatch / "not co-clocked" guards. The clock-GENERATION topology (leg clock
// role, BRG divider, board master/slave pins, MCLK + FS/BCLK passthrough routing) stays keyed on
// the specific master flag, NOT this umbrella. With APP_B_CODEC_MASTER=0 this is identical to
// APP_USE_SPI2_INDEPENDENT_MASTER, so the umbrella rename is a no-op for the existing configs.
#define APP_B_INDEP_DOMAIN  (APP_USE_SPI2_INDEPENDENT_MASTER || APP_B_CODEC_MASTER)

#if APP_B_CODEC_MASTER && APP_USE_SPI2_INDEPENDENT_MASTER
  #error "APP_B_CODEC_MASTER and APP_USE_SPI2_INDEPENDENT_MASTER are mutually exclusive (one clock master per B sync domain)."
#endif
#if APP_B_CODEC_MASTER && !APP_USE_SPI2_AUDIO
  #error "APP_B_CODEC_MASTER requires APP_USE_SPI2_AUDIO with WM8904-B."
#endif
#if APP_B_CODEC_MASTER && APP_Q27B_COHERENT_OFFSET
  #error "APP_B_CODEC_MASTER (B on its own XTAL = truly independent) is incompatible with APP_Q27B_COHERENT_OFFSET (A-locked coherent offset)."
#endif


// (2.5f) Block size (APP_BLOCK_FRAMES) + DRC-test working-buffer sizing.
//       RELOCATED here (from the old (2.3) slot) because the regular-mode AK512 block size is now
//       gated by APP_B_INDEP_DOMAIN (the ASRC engine, resolved just above at (2.5e)): the ASRC
//       build uses a smaller block (RAM savings); the classic co-clock demo keeps 32 (CMSIS
//       batching). APP_BLOCK_FRAMES is set on BOTH sides of the DRC switch, so it is always
//       defined -- no separate fallback guard is needed. The DRC side ALSO sizes the
//       biquad-cascade / sample-delay working buffers (those DSP stages are DRC-only, enabled in
//       (2.6)); the regular side needs only the block size.
#if ENA_DRC_DF2T_CASCADE
//
// DRC test mode -- block size + DSP working buffers
//
 #if 0
  #define APP_BLOCK_FRAMES              (1)           // frames per ping/pong half
  #define BIQUAD_CASCADE_4CH_NUM_STAGE  (22)          // cmsis opt v1 & o3 OK
//  #define BIQUAD_CASCADE_4CH_NUM_STAGE  (6)           // cmsis opt v1 & o3 OK

