sulaolab/dspic33ak-audio-dsp-sonora/src/app/app_specific_config_defs.h
  #define AUDIO_SAMPLE_DELAY_POOL_BYTES  (41000)      // in case of using far memory

 #else
  #define APP_BLOCK_FRAMES              (32)          // frames per ping/pong half

  // BIQUAD_CASCADE_4CH_NUM_STAGE -- the ONE place this value is chosen, and the one place the
  // stage-count history is kept. Do not re-introduce a commented ladder of past values next to
  // the #define (it used to live here AND in biquad_cascade_4ch.h, which disagreed); the header
  // now only holds a fallback for builds that never reach this file.
  //
  // Stage-count challenge: how many 4-ch DF2T stages fit under 100% load.
  // Pass criterion = hardware measurement, TDMsum peak < 100% with miss=0 (not a clean compile).
  //   48 kHz, block=32, CMSIS opt v1 / -O2, ~1.84 us per stage for 4 ch:
  //     22 long-standing reference   ... 75 OK
  //     80 OK  (TDM1 94.0%, margin 39.9 us)
  //     82 OK  (TDM1 96.5%, margin 23.3 us, TDMsum peak 98.8%)   measured 2026-08-13
  //     83 OK  (TDM1 97.6%, margin 15.9 us, TDMsum peak 99.8%)   measured 2026-08-13
  //     83 OK  (TDM1 97.3%, margin 17.8 us) with the leg-B block-IRQ gate, listened OK
  //     84 <-- current. OK (TDM1 98.7%, margin 8.6 us, miss=0, sat=0), listened OK, on the
  //        gated build; re-measured 2026-08-13. Equals the old record.
  //        81/82 were once noted "NG" in the header; stale.
  //   Reading the numbers: the TDMsum peak saturates near the 666.6 us window (two ISRs can
  //   straddle one window), so past ~99.5% it stops discriminating -- at 84 it sits at the
  //   ceiling in 98% of windows and says nothing. Judge by TDM1's own max and miss=0, and by
  //   listening (see AVAS acceptance: a full listen, not a residual).
  //   Also do NOT read the per-stage cost off TDM1:max -- its absolute value shifts with build
  //   layout (83->84 moved it 9.2 us). The stage cost is in the DSP line: CMSIS-IIR 152.6 ->
  //   154.4 us, i.e. the expected ~1.8 us for one 4-ch stage.
  //   96 kHz, block=32: 22 OK; 39 was tried as the 96 kHz challenge value.
  #if defined(ENA_96K_RATE)
    #define BIQUAD_CASCADE_4CH_NUM_STAGE  (22)
  #else
    #define BIQUAD_CASCADE_4CH_NUM_STAGE  (84)
  #endif //defined(ENA_96K_RATE)

  // Was 25*1024=25600; the AK512 serial-update (resident bootloader) link for this
  // profile has no headroom left in the single 64 KiB data-RAM region for the stack
  // once BSS is placed (elf-ld "Not enough memory for stack", 2112 needed/104
  // available) -- this pool is pure unused headroom (nothing in the tree sets a
  // nonzero default delay; it is only ever configured live via the debug console),
  // so trimming it is free RAM for the linker, not a feature cut.
  #define AUDIO_SAMPLE_DELAY_POOL_BYTES  (22u * 1024u) // 22*1024=22528
//  #define AUDIO_SAMPLE_DELAY_POOL_BYTES  (41000)      // in case of using far memory

 #endif //01

#else
//
// Regular mode -- block size only (DRC working buffers not used here)
//
// The AUDIO ENGINE is the outer gate here, not the part. Block size follows what
// the engine wants to batch, and that does not change between silicon: an
// 8ch<->8ch ASRC wants the same ping/pong half on AK128 as on AK512.
//
// This was keyed on APP_TARGET first, so everything that was not AK512 fell
// through to one AK128 value -- and the AK128 bi-codec ASRC build therefore
// inherited block=4 (83.3 us at 48 kHz), a number chosen for a Classic-1
// low-latency experiment and never decided for ASRC. Found on the first AK128
// bi-codec hardware run, 2026-08-17, from the console's own
// "block=4 ... margin=83.3us" telemetry.
//
// APP_B_INDEP_DOMAIN is the discriminator rather than SONORA_APP_IS_ASRC because
// it is what this file already calls "the ASRC engine gate" (see (2.3) and the
// note above). The two differ only for a build that raises
// APP_REQ_SPI2_INDEPENDENT_MASTER without being the ASRC App -- no such
// configuration exists, and the owner does not expect one (2026-08-17) -- so
// this is the same set in practice, chosen because it also leaves that
// theoretical case on the 16 it had before this restructure rather than moving
// it. Every ASRC build has it set (the boundary invariants below #error out if
// it does not), so no ASRC build can miss this.
 #if APP_B_INDEP_DOMAIN
  // OVERRIDABLE by an ASRC build-config block (included from (2.0) above, so a
  // #define there wins).  The look-ahead one ASRC pull needs is
  // R(step) = floor(step*(APP_BLOCK_FRAMES-1)) + ASRC_POLY_AHEAD + 1, so the CONSUMER's
  // block length -- not the ring depth alone -- is what bounds the rate ratio a given ring
  // can serve (see ASRC_BURST_RATIO_LIMIT_* in audio_app_asrc.c).  A build that has to
  // reach low output rates out of a small ring can trade ISR rate for look-ahead here.
  #ifndef APP_BLOCK_FRAMES
   #define APP_BLOCK_FRAMES        (16)     // async (ASRC) engine, either part
  #endif
 #elif APP_TARGET == APP_TARGET_AK512
  #define APP_BLOCK_FRAMES         (32)     // classic co-clock demo (CMSIS batching)
 #else
  #define APP_BLOCK_FRAMES         (4)      // AK128 Classic: low-latency experiment value
 #endif //APP_B_INDEP_DOMAIN

#endif //ENA_DRC_DF2T_CASCADE


// (2.5e) CLOCK TREE -- FIXED, one configuration per PLL, no per-application variation.
//
//   PLL1 <- FRC, 200 MHz       ALWAYS, every build. CPU / SysCLK / CLKGEN1,6,9.
//   PLL2 <- REFI1, 798.72 MHz  Only where an application needs a clock coherent with the codec,
//                              and always that same configuration.
//
// This is a hardware constraint, not a preference. A PLL only re-locks across a NON-POWER reset to
// the configuration it was already locked to; asking for a different one hangs the PLLSWEN handshake
// and latches it, so the board then needs a power cycle no matter what the firmware does next.
// Measured with mdb on a halted CPU -- see [internal] clock_design_contract.md and
// [internal] clock_design_contract.md appendix A.
//
// Consequences to respect when editing this file:
//   - NO FALLBACK anywhere in a PLL bring-up. A fallback makes two configurations reachable on one
//     board, which is exactly the failure. If the intended reference is absent, report and stop.
//   - A PLL's source is a property of the BOARD, not of the application. Do not reintroduce a
//     per-profile clock "case".
//   - PLL1_CLK_HZ is shared by the whole project. Changing FCY per build would reintroduce the trap.
//   - If CPU jitter ever needs improving, the answer is a system crystal on POSC (a board property),
//     not sourcing the system from the codec's BCLK.
//
// This replaced an APP_CLK_CASE 0..3 axis (per-profile PLL1/PLL2 feeds, with an XTAL-first PLL1
// attempt and an FRC fallback) and the Q48 RA15/RP16 clamp + 3-state-gate machinery. Q48's premise --
// that the 12.288 MHz on RP16 breaks the FRC->PLL1 boot -- was disproved on 2026-07-30: stopping BCLK
// on both codecs (scope-verified) did not fix the boot. The design contract's section 5 records the
// full reasoning and what would justify re-opening it.

// Does this build take SPI2's transport clock from PLL2 (coherent with the codec) instead of PLL1?
// This is a feature flag, not a clock tree variant: PLL2's own configuration is identical either way.
#ifndef APP_SPI2_CLOCK_FROM_PLL2
#define APP_SPI2_CLOCK_FROM_PLL2   (0)
#endif
#define APP_CLK_SPI_ON_PLL2        (APP_SPI2_CLOCK_FROM_PLL2)

// Does this build take the CCP capture time base (CLKGEN13) from PLL2 instead of the FCY peripheral
// clock? Same kind of flag, and the same single PLL2 configuration -- only the consuming CLKGEN
// differs. It buys ABSOLUTE fs accuracy for the ASRC/MEAS rate measurement: with the time base
// derived from the codec crystal instead of the FRC, the measurement's frequency bias is structurally
// zero (99.84 MHz / 12.288 MHz = 8.125 exactly) rather than the FRC's error -- which is measured
// per part and is NOT a constant: +0.66 % on board ...1164, +0.41 % on board ...0057. That is why a
// self-calibration scale is only valid for the board and the boot that measured it. It does NOT
// affect servo stability, which is driven by the FIFO fill error and is immune to time-base error.
//
// Requires codec-A to master BCLK, because that is the configuration in which the codec's crystal
// output reaches REFI1 (RP16). Note what REFI1 actually carries: XTALout, which is fs-INDEPENDENT.
// Measured -- a 48k -> 16k codec-A rate change moved BCLK_DIV 0x0 -> 0x3 while the reading stayed
// exact -- so a rate change cannot invalidate PLL2's fixed input_hz. See the design contract's
// section 9.
#ifndef APP_CCP_TIMEBASE_FROM_PLL2
#define APP_CCP_TIMEBASE_FROM_PLL2 (0)
#endif

#if APP_CCP_TIMEBASE_FROM_PLL2
  #if APP_PROFILE != APP_PROFILE_ASRC
    #error "APP_CCP_TIMEBASE_FROM_PLL2 only means anything for the ASRC profile -- it is the CCP rate measurement's time base."
  #endif
  // The dsPIC-owner presets drive the transport clock themselves, so codec-A is not mastering and
  // its clock output does not reach REFI1: PLL2 has no reference. Note the reference is codec-A's
  // XTALout on REFI1<-RP16, not BCLK -- codec-master mode is the configuration in which that output
  // is present, not the thing being measured. Report at compile time rather than on hardware.
  #if APP_USE_SPI_TDM_CLK_MASTER
    #error "APP_CCP_TIMEBASE_FROM_PLL2 needs codec-A master mode with its XTALout present on REFI1<-RP16 (requires APP_USE_SPI_TDM_CLK_MASTER=0)."
  #endif
  // PWM audio and the Q27B test are the other PLL2 consumers. Sharing PLL2 with them is sound in
  // principle -- it is the same configuration -- but the combination is unexercised, so refuse it
  // here rather than ship an untested clock interaction.
  #if defined(ENA_PWM_AUDIO)
    #error "APP_CCP_TIMEBASE_FROM_PLL2 shares PLL2 with PWM audio; that combination is unexercised. Disable ENA_PWM_AUDIO."
  #endif
  #if APP_Q27B_COHERENT_OFFSET
    #error "APP_CCP_TIMEBASE_FROM_PLL2 combined with APP_Q27B_COHERENT_OFFSET is unexercised; enable only one."
  #endif
  #if APP_SPI2_CLOCK_FROM_PLL2
    #error "APP_CCP_TIMEBASE_FROM_PLL2 combined with APP_SPI2_CLOCK_FROM_PLL2 is unexercised; enable only one."
  #endif
#endif


// (2.6) Feature set selected by the build profile (toggles + device).
//   The DEMO profile gets the full A-side audio-filter demo set below; the ASRC profile defines
//   NONE of it (positive single-definition -- the ASRC engine resamples the raw A input regardless
//   of the A-side DSP, so dropping the demo set frees flash/RAM/CPU and keeps the ASRC app
//   self-contained). Touch is likewise enabled only for the Classic AK512 UI above.
#if APP_PROFILE != APP_PROFILE_ASRC

