sulaolab/dspic33ak-audio-dsp-sonora/src/app/app_specific_config_defs.h
#if ENA_DRC_DF2T_CASCADE
//
// DRC Test mode
//
#if APP_TARGET != APP_TARGET_AK128
  // AK128MC106 has only 16 KB data RAM; the biquad-cascade and sample-delay
  // working buffers (sample-delay pool alone is ~12.5 KB) do not fit there.
  // These DSP stages are therefore AK512-only. AK512 is unaffected (the guard
  // is true on AK512, so the macro set is identical to before).
  #define ENA_BIQUAD_IIR_CASCADE
  #define ENA_SAMPLE_DELAY
//  #define ENA_FIR_FILTER
#endif //APP_TARGET != APP_TARGET_AK128


#else
//
// Regular mode
//
 // This block compiles only in the Classic Audio Demo profile (APP_PROFILE != APP_PROFILE_ASRC),
 // so the full standard-demo audio-effect set is always enabled here. (The former ASRC-bench RAM
 // reclaim -- guarding ANC_MONITOR/BASS_ENHANCER/WIDEN_CTRL on !APP_ASRC_MEAS -- lived in the ASRC
 // profile, which no longer shares this header; the guards were structurally always-true here.)
 /* ANC monitor: allocate it only when something reads it.
  *
  * ancmon_t is 4,188 B of RAM -- on AK128MC106 that is 44 % of the whole 16 KiB
  * data space -- and its only consumer is the 200 ms readout in
  * apps/classic/classic_demo_app.c, which is gated by ENA_ANC_TEST (off by
  * default, see "--- ANC TEST ---" above).  Defining ENA_ANC_MONITOR
  * unconditionally therefore reserved the struct so that classic_audio_path.c
  * could memset it once at init and nothing could ever look at it: with
  * ENA_ANC_TEST off, --gc-sections drops every ancmon function except
  * ancmon_init(), and the buffers stay.
  *
  * Turning ENA_ANC_TEST on is NOT sufficient to get a reading.  The two feeds,
  * app_ancmon_process_in() and app_ancmon_process_out(), have no caller in the
  * tree at all, so the printed levels, peaks and clip count would all read zero;
  * reviving the monitor means calling them from the block loop in
  * apps/classic/classic_audio_path.c as well.  Budget for it before doing that
  * on AK128: ancmon_est_delay_main() adds a second 4,096 B static snapshot pair,
  * so the working monitor is 8,284 B and does not fit beside the rest. */
#if defined(ENA_ANC_TEST)
 #define ENA_ANC_MONITOR
#endif
 //
 // memory eaters
 //
 /* Additive AVAS sources.  BOTH are built in and selected at run time, so the
  * A/B needs no rebuild:  'a' = TYPE_TY, 'A' = LAMB, mute-button long
  * press = TYPE_TY.  This used to be a build-time choice with an #error, which
  * meant reflashing to compare the two.
  *
  * They are exclusive at RUN TIME, and strictly: while one is sounding -- gate
  * fade included -- the other refuses to start (UsrOperate_avas_synth* in
  * apps/classic/classic_controls.c).  That is a load requirement, not a UI
  * preference: TYPE_TY alone measures 45.8 % of the 666.6 us block window on
  * hardware, so two engines running together could exceed the budget.  With
  * the refusal, peak load is max(TYPE_TY, LAMB), not their sum.  The
  * idle engine costs nothing measurable -- both return 0 immediately when
  * fully gated off.
  *
  * To build only one (flash pressure, or to profile a single engine), comment
  * the other out HERE.  A -Define cannot undefine, so there is no build switch
  * for it.
  *
  * Pass the bare name, with NO value.  Both switches are tested with
  * defined(), which ignores the value, so -Define ENA_AVAS_TYPE_TY_SYNTH=0 reads
  * like "disable" and in fact SELECTS TYPE_TY.  The preprocessor cannot tell an
  * empty expansion from a 0 one, so this cannot be diagnosed here; use the
  * bare name.  Same for every other ENA_* switch tested with defined().
  *
  * AK128 gets TYPE_TY only. Not the "last thing to drop" principle below being
  * reversed -- AVAS itself stays (TYPE_TY) -- but AK128 Classic 1 no longer
  * fits ROM after the hal_pwm HAL migration (2026-08-16),
  * and dropping the second voice's tables (avas_synth_type_lb*.c/.h) recovers
  * far more than the ~350 B still short. */
 #if !defined(ENA_AVAS_TYPE_LB_SYNTH) && (APP_TARGET != APP_TARGET_AK128)
  #define ENA_AVAS_TYPE_LB_SYNTH
 #endif
 #if !defined(ENA_AVAS_TYPE_TY_SYNTH)
  #define ENA_AVAS_TYPE_TY_SYNTH
 #endif

 #if !defined(ENA_AVAS_TYPE_LB_SYNTH) && !defined(ENA_AVAS_TYPE_TY_SYNTH)
  #error "Select at least one additive AVAS source"
 #endif

 /* Sound effects are an AK512 feature set. The AK128 part has 128 KiB of program
  * Flash and has to fit a 32 KiB resident bootloader plus the manifest page
  * inside it, so the demo's decorative sources are the first thing to go there --
  * the same reasoning that already keeps KINKON / CLICK_CLACK / SND_EFFECT_PLAY
  * below AK512-only. AVAS ITSELF is deliberately NOT in here: it is the demo's
  * point, not decoration, and it is the last thing to drop rather than the
  * first. Its second voice (TYPE_LB) is a narrower exception, gated above
  * for ROM, not decided here. */
 #if APP_TARGET != APP_TARGET_AK128
  #define ENA_PINGER_SOUND
 #endif //APP_TARGET != APP_TARGET_AK128

 #define ENA_FLIP4_KEEPALIVE    // JBL Flip4 anti Auto-Mute (functional, not an effect)

 #if APP_TARGET == APP_TARGET_AK512
  #define ENA_BASS_ENHANCER
  #define ENA_WIDEN_CTRL

  #if !defined(ENA_96K_RATE)
  #define ENA_ENGINE_SYNTH      // it needs POT. AK128 doesn't use POT.
  #endif //!defined(ENA_96K_RATE)

  #define ENA_DEESSER
  #define ENA_KINKON
  #define ENA_CLICK_CLACK

  // ASRC-engine builds (APP_B_INDEP_DOMAIN = codec-master or dsPIC-independent-master) don't use
  // the button sound-effect playback; its tone data (Tone_ON/OFF/Notif ~102 KB of const in PROGRAM
  // FLASH, tone_data_int16.c) + the SST26 verify are then dead weight, so define it only when the
  // ASRC engine is OFF -- reclaims that flash independent of profile.
  #if !APP_B_INDEP_DOMAIN && APP_USE_SST26
  #define ENA_SND_EFFECT_PLAY
  #endif //!APP_B_INDEP_DOMAIN && APP_USE_SST26
 #endif //APP_TARGET == APP_TARGET_AK512

#endif //ENA_DRC_DF2T_CASCADE

#endif //APP_PROFILE != APP_PROFILE_ASRC (the ASRC profile defines none of the demo effect set above)


// (2.6b) Bass-enhancer monitor (the "Lv=..." debug line) visibility is a Classic-app concern
// (the monitor is only meaningful when the A-side DSP bass-enhancer runs). Its derivation now
// lives in the Classic app itself (classic_demo_app.c), next to the sole consumer, so the common
// header no longer references the ASRC-only route/measurement terms it used to gate on.


// (2.7) ENA_* tree -> numeric 0/1 APP_* facts. New validation / debug-print code
// should prefer these so it does not need to repeat defined(ENA_*) logic.
// (APP_TARGET is derived earlier, in section (2.0).)


// User-selectable features / profiles
#if defined(ENA_96K_RATE)
  #define APP_USE_96K_RATE              (1)
#else
  #define APP_USE_96K_RATE              (0)
#endif

#if defined(ENA_USB_AUDIO_IN)
  #define APP_USE_USB_AUDIO_IN          (1)
#else
  #define APP_USE_USB_AUDIO_IN          (0)
#endif

// ENA_DRC_DF2T_CASCADE is defined directly in the user-config section above.


