sulaolab/dspic33ak-audio-dsp-sonora/src/app/app_specific_config_defs.h
// (APP_USE_SPI2_AUDIO is defined above in (2.5) directly from the app's own condition.)


// Effective numeric geometry
// APP_SLOTS_PER_FS and APP_BLOCK_FRAMES are defined directly in sections (2.4) and (2.3).
#define APP_SAMPLE_RATE_HZ              (SAMPLE_RATE)

// Sample-rate POLICY for this product. This is NOT a HAL property -- the SPI/I2S/TDM
// transport is rate-agnostic (runs at whatever BCLK/FS the clock provides). It is the
// supported-rate set of THIS board/application (the external USB-Audio board's clock
// family): currently the 48 kHz family (48k native, 96k via the dual-codec I2S path).
// Used by the Validation section (compile-time check of APP_SAMPLE_RATE_HZ) and by the
// CMSIS-SAI wrapper to validate an ARM_SAI AUDIO_FREQ request.
#define APP_SAMPLE_RATE_IS_SUPPORTED(hz)   (((hz) == 48000u) || ((hz) == 96000u))
#define APP_STAGE1_PROC_CH              (STAGE_1_PROC_CH)
#define APP_STAGE2_PROC_CH              (STAGE_2_PROC_CH)


// CMSIS-SAI verification modes
#if defined(ENA_SAI_WRAPPER_DRYTEST)
  #define APP_USE_SAI_WRAPPER_DRYTEST   (1)
#else
  #define APP_USE_SAI_WRAPPER_DRYTEST   (0)
#endif

#if defined(ENA_SAI_WRAPPER_LIVE)
  #define APP_USE_SAI_WRAPPER_LIVE      (1)
#else
  #define APP_USE_SAI_WRAPPER_LIVE      (0)
#endif

#if defined(ENA_SAI_WRAPPER_LIVE_TONE)
  #define APP_USE_SAI_WRAPPER_LIVE_TONE (1)
#else
  #define APP_USE_SAI_WRAPPER_LIVE_TONE (0)
#endif

#if defined(ENA_SAI_LIVE_KEEPALIVE)
  #define APP_USE_SAI_LIVE_KEEPALIVE    (1)
#else
  #define APP_USE_SAI_LIVE_KEEPALIVE    (0)
#endif

#if defined(ENA_APP_RAW_BYPASS)
  #define APP_USE_APP_RAW_BYPASS        (1)
#else
  #define APP_USE_APP_RAW_BYPASS        (0)
#endif

#if defined(ENA_SAI_HYBRID_IN_ORIG_OUT_WRAP)
  #define APP_USE_SAI_HYBRID_OUT_WRAP   (1)
#else
  #define APP_USE_SAI_HYBRID_OUT_WRAP   (0)
#endif


/* ============================================================
 * 3. Validation  (reject invalid combinations; create no new config values)
 * ============================================================ */
// Combination checks live here, after the Resolved section has converted the
// scattered ENA_* tree into 0/1 APP_* facts.

// Target device: "exactly one" is now structural -- the #elif/#else+#error in the
// APP_TARGET derivation (Resolved section) already rejects unknown/absent devices.

// App boundary invariants. App identity is selected by APP_BUILD; transport topology
// may vary inside that app but cannot silently turn it into the other application.
#if SONORA_APP_IS_ASRC && (APP_TARGET != APP_TARGET_AK512) && !APP_AK128_J3_TDM_B
  #error "The ASRC App requires AK512 or the explicit AK128 J3 bi-codec capability."
#endif
#if SONORA_APP_IS_ASRC && !APP_B_INDEP_DOMAIN
  #error "The ASRC App requires an independent B clock domain."
#endif
#if SONORA_APP_IS_CLASSIC && APP_B_INDEP_DOMAIN
  #error "Classic Audio Demo variations may not enable the ASRC independent B domain."
#endif


// Audio topology / source conflicts
#if APP_USE_96K_RATE && !APP_USE_SPI2_AUDIO
  #error "ENA_96K_RATE requires a configured second WM8904/SPI2 audio path on dsPIC33AK512."
#endif

#if APP_USE_PWM_AUDIO && (APP_TARGET != APP_TARGET_AK512)
  #error "APP_USE_PWM_AUDIO needs the dsPIC33AK512 target."
#endif

#if APP_TDM_USES_SPI34 && APP_USE_PWM_AUDIO
  #error "SPI3/SPI4 TDM uses DMA4-7; disable PWM audio before selecting an SPI3/4 port mode."
#endif

// (The "SPI3/SPI4 TDM is ASRC-only" check references the ASRC-private APP_B_ROUTE_IS_ASRC and
//  now lives in apps/asrc/asrc_app_validate.h, included from the end of this section.)

#if defined(ENA_SND_EFFECT_PLAY) && !APP_USE_SST26
  #error "ENA_SND_EFFECT_PLAY requires APP_USE_SST26 (button effects are stored in external flash)."
#endif

#if (APP_TDM_PORT_MODE < APP_TDM_PORT_MODE_SPI12) || \
    (APP_TDM_PORT_MODE > APP_TDM_PORT_MODE_ALL4)
  #error "APP_TDM_PORT_MODE is invalid."
#endif

#if APP_TDM_PORT_MODE == APP_TDM_PORT_MODE_ALL4
  #error "ALL4 needs the second TDM8 endpoint pin map and four-leg board system table; use SPI12 or SPI34_TEST for now."
#endif

// WM8904-B (dual codec on MikroBUS-B/SPI2) and PWM audio (PWM5-8) cannot coexist:
// they collide on exactly one pin, RP97 -- used both as PWM5L and as the
// CLC3 -> WM8904-B MCLK fan-out (board/audio/audio.c). The SPI2 data/clock lines
// (RP29/90/89/92) do NOT overlap with the PWM pins; RP97 is the sole conflict, so
// the two output paths are exclusive until PWM5L (or codec-B MCLK) is relocated.
#if APP_USE_PWM_AUDIO && APP_REQ_MIKROB_WM8904
  #error "Audio-out conflict: enable EITHER ENA_MIKRO_B_WM8904 (codec-B) OR ENA_PWM_AUDIO (PWM5-8), not both -- they share MikroBUS-B pin RP97 (PWM5L vs codec-B MCLK). Comment out one in app_specific_config_defs.h."
#endif

#if APP_USE_USB_AUDIO_IN && (APP_TARGET != APP_TARGET_AK512)
  #error "ENA_USB_AUDIO_IN: USB audio DIM connector is only wired on the dsPIC33AK512 Curiosity board."
#endif


// Clock / transport invariants
#if APP_USE_USB_AUDIO_IN && APP_USE_SPI_TDM_CLK_MASTER
  #error "ENA_USB_AUDIO_IN requires SPI-TDM clock slave mode; disable ENA_SPI_TDM_CLK_MASTER."
#endif

#if APP_USE_96K_RATE && !APP_USE_I2S_FORMAT
  #error "ENA_96K_RATE must resolve to I2S format."
#endif

#if APP_USE_I2S_FORMAT && (APP_SLOTS_PER_FS != 2)
  #error "I2S format must resolve to APP_SLOTS_PER_FS == 2."
#endif

#if APP_USE_TDM8_FORMAT && (APP_SLOTS_PER_FS != 8)
  #error "TDM8 format must resolve to APP_SLOTS_PER_FS == 8."
#endif

#if APP_USE_I2S_FORMAT && !APP_USE_1_BIT_DELAY
  #error "I2S format requires APP_USE_1_BIT_DELAY 1."
#endif

#if APP_USE_SPI2_AUDIO && (APP_TARGET != APP_TARGET_AK512) && !APP_AK128_J3_TDM_B
  #error "APP_USE_SPI2_AUDIO requires AK512 or the explicit AK128 J3 TDM-B capability."
#endif

#if APP_USE_SPI2_AUDIO && !APP_REQ_MIKROB_WM8904
  #error "APP_USE_SPI2_AUDIO requires APP_REQ_MIKROB_WM8904 1."
#endif


// SPI2 independent-clock-domain (Phase 1) invariants. This mode makes SPI2 a
// standalone dsPIC TDM master while SPI1 stays codec-A's clock slave, so it needs the
// dual-codec SPI2 path, the AK512 board, and the A-domain in codec-master mode. It is
// incompatible with the 96K split-codec topology (that path is inherently co-clocked:
// A=ADC half, B=DAC half of ONE stream) and with USB-audio-in (A is codec-A master here,
// not the USB clock). TDM8 is required (the BRG constant assumes the 256-BCLK frame).
// (APP_USE_SPI2_INDEPENDENT_MASTER is already 1 only when APP_USE_SPI2_AUDIO is 1 -- see
// its derivation in the Resolved section -- so the "needs the SPI2 path" case is structural.)
#if APP_USE_SPI2_INDEPENDENT_MASTER
  #if APP_USE_SPI_TDM_CLK_MASTER
    #error "APP_USE_SPI2_INDEPENDENT_MASTER requires the A-domain in codec-master mode (APP_USE_SPI_TDM_CLK_MASTER 0)."
  #endif
  #if APP_USE_96K_RATE
    #error "ASRC profile (APP_USE_SPI2_INDEPENDENT_MASTER) is incompatible with ENA_96K_RATE -- that dual-codec split is co-clocked, not independent. FIX: build with APP_PROFILE=APP_PROFILE_DEMO (turns ASRC off), or drop ENA_96K_RATE."
  #endif
  #if APP_USE_USB_AUDIO_IN
    #error "ASRC profile (APP_USE_SPI2_INDEPENDENT_MASTER) is incompatible with ENA_USB_AUDIO_IN -- A is codec-A master here; USB-audio needs the co-clocked (non-independent) SPI2. FIX: build with APP_PROFILE=APP_PROFILE_DEMO (turns ASRC off), or drop ENA_USB_AUDIO_IN."
  #endif
  #if !APP_USE_TDM8_FORMAT
    #error "APP_USE_SPI2_INDEPENDENT_MASTER (Phase 1) assumes TDM8 (APP_SPI2_MASTER_BRG targets the 256-BCLK frame)."
  #endif
#endif

// (The UART2 long-stream and Q19-eval invariants reference ASRC-private measurement symbols
//  (APP_ASRC_MEAS_UART2_STREAM, APP_MEAS_DIR, APP_B_ROUTE_IS_ASRC, APP_ASRC_Q19_EVAL) and now
//  live in apps/asrc/asrc_app_validate.h, included from the end of this section.)


