sulaolab/dspic33ak-audio-dsp-sonora/src/app/app_specific_config_defs.h
// Numeric configuration sanity. The supported-rate policy lives in one place
// (APP_SAMPLE_RATE_IS_SUPPORTED above) -- this is the product/board's rate set,
// NOT a HAL property.
#if !APP_SAMPLE_RATE_IS_SUPPORTED(APP_SAMPLE_RATE_HZ)
  #error "APP_SAMPLE_RATE_HZ is not in this product's supported-rate set (APP_SAMPLE_RATE_IS_SUPPORTED)."
#endif

#if (APP_BLOCK_FRAMES <= 0)
  #error "APP_BLOCK_FRAMES must be positive."
#endif

#if (APP_STAGE1_PROC_CH <= 0)
  #error "APP_STAGE1_PROC_CH must be positive."
#endif

#if (APP_STAGE2_PROC_CH <= 0)
  #error "APP_STAGE2_PROC_CH must be positive."
#endif


// SAI verification harness consistency
#if APP_TDM_BASE_ON_SPI34 && \
    (APP_USE_SAI_WRAPPER_LIVE || APP_USE_SAI_WRAPPER_DRYTEST)
  #error "CMSIS-SAI Driver_SAI0 is bound to physical SPI1; SPI3/4 test mode is unsupported."
#endif

#if ((APP_USE_APP_RAW_BYPASS + APP_USE_SAI_HYBRID_OUT_WRAP) > 1)
  #error "SAI verify: enable at most ONE of ENA_APP_RAW_BYPASS / ENA_SAI_HYBRID_IN_ORIG_OUT_WRAP."
#endif

#if APP_USE_SAI_HYBRID_OUT_WRAP && !APP_USE_SAI_WRAPPER_LIVE
  #error "SAI verify: ENA_SAI_HYBRID_IN_ORIG_OUT_WRAP requires ENA_SAI_WRAPPER_LIVE."
#endif

#if APP_USE_APP_RAW_BYPASS && APP_USE_SAI_WRAPPER_LIVE
  #error "SAI verify: ENA_APP_RAW_BYPASS is the demo path -- disable ENA_SAI_WRAPPER_LIVE."
#endif

#if APP_USE_SAI_WRAPPER_LIVE_TONE && !APP_USE_SAI_WRAPPER_LIVE
  #error "SAI verify: ENA_SAI_WRAPPER_LIVE_TONE requires ENA_SAI_WRAPPER_LIVE."
#endif

#if APP_USE_SAI_LIVE_KEEPALIVE && !APP_USE_SAI_WRAPPER_LIVE
  #error "SAI verify: ENA_SAI_LIVE_KEEPALIVE requires ENA_SAI_WRAPPER_LIVE."
#endif

// The CMSIS-SAI wrapper live route configures SPI1 as a clock SLAVE (external BCLK/FS). Combining
// it with the self-clocked dsPIC master (APP_USE_SPI_TDM_CLK_MASTER) is contradictory: the master
// path generates no external clock to be "ready", so the stream would report is_running() up on a
// clock that is not actually gated. Reject the nonsensical combo at compile time (F3).
#if APP_USE_SAI_WRAPPER_LIVE && APP_USE_SPI_TDM_CLK_MASTER
  #error "SAI verify: ENA_SAI_WRAPPER_LIVE (SPI1 slave) is incompatible with APP_USE_SPI_TDM_CLK_MASTER (self-clocked master)."
#endif


//===========================================================
// Misc app-wide setup (not configuration values)
//===========================================================

// GPIO is configured through the hal_gpio API (nora_gpio.h): prefer the
// RP-first calls (e.g. nora_gpio_rp_config_digital_output(rp, false)) and
// the packed-pin core for non-RP pins. The old literal (port,bit) GPIO_*
// convenience macros have been removed.


// app_utils.h (COMPILEASSERT, ARRAY_SIZE, biquad_t, app_memcpy etc.) and the
// memset/memcpy ISR-safe overrides live in app_runtime_overrides.h.
// Include that from each app-side .c -- NOT from this config header, so the
// overrides do not reach the HAL core through the resolved compile-time adapters.


// ASRC-app-private validation fragment. Kept out of this shared header so the common layer
// never names an ASRC-private symbol; included only for ASRC builds, after all common and
// ASRC facts above are defined. (Classic builds neither include nor need it.)
#if SONORA_APP_IS_ASRC
#include "apps/asrc/asrc_app_validate.h"
#endif


/* ============================================================
 * 4. Completion marker
 * ============================================================ */
#define APP_SPECIFIC_CONFIG_READY 1

#endif //!APP_SPECIFIC_CONFIG_DEFS_H
